termin1/termin1.tex
% Created 2023-06-10 Sat 23:48
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{placeholder}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={placeholder},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.0.50 (Org mode 9.6.1)}, 
 pdflang={English}}
\begin{document}

\begin{center}
\begin{tabular}{|l|l|}
\hline
\multicolumn{2}{|l|}{Politechnika Świętokrzyska w Kielcach} \\
\multicolumn{2}{|l|}{Wydział Elektrotechniki,Automatyki I Informatyki} \\
\hline
\multicolumn{2}{|l|}{Podstawy Programownaia 2 - Projekt} \\
\multicolumn{2}{|l|}{Informatyka - I Rok akademicki 2022/2023} \\
\hline
Temat Projektu: & Wykonali: \\
Wypożyczalnia Samochodów & 1. Rafał Grot \\
 & 2. Kamil Gunia \\
 & 3. Jakub Grzelec \\
 & 4. Karina Goszczyńska \\
\hline
\end{tabular}
\end{center}
\section{Pierwszy kamień milowy}
\label{sec:org56d3d1a}
\subsection{Opanowanie systemu kontroli wersji \texttt{git}.}
\label{sec:org5a91803}
Mogło być lepiej ale damy radę.
\subsection{Podział pracy w zespole.}
\label{sec:orgbe6bf3f}
\sout{Mogło być lepiej ale damy radę.} Jednak nie daliśmy. Tak jak widać w repozytorium
\href{https://github.com/rafal11ck/PSK-INF-PROJ-podstway-programowania-2/}{Link}
\textbf{Szczególnie wkład.}
\subsection{Projekt relacyjnej bazy danych samochodów, klientów, wypożyczeń.}
\label{sec:orgb029f04}
Jest. Włącznie z implementacją.
\subsection{Zapoznanie się z biblioteką \texttt{sqlite} \url{https://www.sqlite.org} ,nauka tworzenia i wykonywania prostych kwerend za jej pomocą.}
\label{sec:org0acbd11}
Jest użyta w projekcie
\section{Drugi kamień milowy}
\label{sec:org1734700}
\subsection{Implementacja bazy danych.}
\label{sec:orgd73e259}
Była na 1 KM.
\subsection{Implementacja dodawania, usuwania oraz modyfikacji -- Samochodów i klientów.}
\label{sec:org8039ecb}
\sout{W trakcie, ze względu na podjęte decyzje usuwanie oraz modyfikacja wymaga wyświetlania.} Jest
\subsection{Implementacja wypożyczania i oddawania samochodów}
\label{sec:org2f1003d}
Do realizacja jest wymagana implementacja samochodów. Jeszce nie ma.
\subsection{Wyświetlanie samochodów z możliwością sortowania rosnącego/malejącego.}
\label{sec:org62bbe5e}
\sout{W trakcie.} Jest.
\section{I termin}
\label{sec:orgebebf2d}
\begin{enumerate}
\item Stworzenie dokumentacji w programie \texttt{Doxygen}
Jest od 1 kamienia.
\item Sporządzenie sprawozdania.

\item Dodanie ewentualnych ulepszeń.
Ewentualnie dodatki powinny być widoczne w repozytorium.
\end{enumerate}
\end{document}